# Используем официальный образ Node.js
FROM node:20

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /usr/src/app

# Копируем package.json и package-lock.json для установки зависимостей
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем все файлы приложения в текущую директорию контейнера
COPY . .

# Собираем Nuxt.js приложение в режиме продакшн
RUN npm run build

# Определяем переменные окружения для порта и хоста (необязательно)
ENV NITRO_PORT=3000
ENV NITRO_HOST=0.0.0.0

# Открываем порт, на котором будет работать приложение
EXPOSE 3000

# Команда для запуска Nuxt.js приложения
CMD ["node", ".output/server/index.mjs"]